#!/bin/py
#   -*-coding:utf-8-*-
'       说明               '
_author_ = 'zl'

a=[x+y for x in "12345"  for y in "6789"]
print(a)
# ['16', '17', '18', '19', '26', '27', '28', '29', '36', '37', '38', '39', '46', '47', '48', '49', '56', '57', '58', '59']

a={x:y for x in "ABCDEF" for y in "abcdef"}
print(a)
# {'D': 'f', 'B': 'f', 'F': 'f', 'E': 'f', 'A': 'f', 'C': 'f'}
#非预期,因为这是字典生成,每次x的遍历,总是把最后一个y的遍历结果赋值给x

a={x:y for (x,y) in zip("ABCDEF","abcdef")}
b=(zip("ABCDEF","abcdef"))
for x in b:print(x)
print(a)
# {'A': 'a', 'E': 'e', 'F': 'f', 'D': 'd', 'C': 'c', 'B': 'b'}
#zip函数,语用把几个可迭代对象打包成一个zip对象,内部是tuple list
#('A', 'a')
# ('B', 'b')
# ('C', 'c')
# ('D', 'd')
# ('E', 'e')
# ('F', 'f')

a={x:x**3 for x in range(1,20) if x%10!=0}
print(a)
# {1: 1, 2: 8, 3: 27, 4: 64, 5: 125, 6: 216, 7: 343, 8: 512, 9: 729, 11: 1331, 12: 1728, 13: 2197, 14: 2744, 15: 3375, 16: 4096, 17: 4913, 18: 5832, 19: 6859}